Revit 2026 API

# NavisworksExportOptionsSetSelectedElementIds Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetSelectedElementIds(
	ICollection<ElementId> ids
)
```
```vb
Public Sub SetSelectedElementIds (
	ids As ICollection(Of ElementId)
)
```
```cpp
public:
void SetSelectedElementIds(
	ICollection<ElementId^>^ ids
)
```
```fsharp
member SetSelectedElementIds :
        ids : ICollection<ElementId> -> unit
```

#### Parameters

ids ICollectionElementId

#### Reference

NavisworksExportOptions Class

Autodesk.Revit.DB Namespace